a=["这战术西雅图估计要被针对了。。。<br>\n<br>\n<br>", "这战术西雅图估计要被针对了。。。", "这战术西雅图估计要被针对了。。。", "AOE DOOM太强", 
  "<br>\n这战术西雅图估计要被针对了。。。", "VG现在真是期待啊……", "也可能被其他队伍发扬光大，说实话这小娜迦打得并不好", "这战术西雅图估计要被针对了。。。", 
  "<br>\n这战术西雅图估计要被针对了。。。", "这战术西雅图估计要被针对了。。。", "这战术两年前了 可惜被BKB谜团破 但是！&nbsp;&nbsp;现在萨尔蓝帐可破BKB谜团",
   "<br>\n这战术西雅图估计要被针对了。。。", "又不是什么新战术", "这战术西雅图估计要被针对了。。。", "发现vg的人气好高啊，每次vg要打的时候，
  就高潮了啊", "这个不太好针对 ，也就谜团和A杖拉比克不被睡的情况下能破"]
def arraysame arr
d=[]
c=0
arr.each do |i|
 b=0
 arr.each do |j|
  if i==j
  b+=1
  end
 end
 
 if b>c
 c=b
 d<<i
 end
end
return c,d.last
end
print arraysame a